;dup操作符
;它是和db,dw,dd等数据定义伪指令配合使用的，用来进行数据重复,例如：

db 3 dup (0)
;定义3个字节，它们的值都是0，相当于db 0,0,0

db 3 dup (0,1,2)
;定义9个字节，它们是(0,1,2)、(0,1,2)、(0,1,2)，相当于 db 0,1,2,0,1,2,0,1,2

db 3 dup ('abc','ABC')
;定义了18个字节，它们是'abcABCabcABCabcABC'，相当于db 'abcABCabcABCabcABC'。

;dup使用格式如下：
db 重复的次数 dup (重复的字节型数据)
dw 重复的次数 dup (重复的字型数据)
dd 重复的次数 dup (重复的双字型数据)

;定义一个容量为200个字节的栈段，如果不用dup,则必须
stack segment
    dw 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
    dw 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
    dw 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
    dw 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
    dw 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
stack ends

;使用dup操作符定义200个字节的栈段:
stack segment
    db 200 dup (0)
stack ends


